{
  "No workspace folders are open. Please open a workspace folder to use this extension": "No hay carpetas de espacio de trabajo abiertas. Abre una carpeta de espacio de trabajo para usar esta extensión",
  "Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Selecciona una carpeta de espacio de trabajo. Esa carpeta se usará para cargar la configuración específica de la extensión",
  "The {0} extension is now enabled and ready to use": "La extensión {0} está habilitada y lista para usarse",
  "The {0} extension is now disabled": "La extensión {0} está deshabilitada",
  "The {0} extension is disabled in settings. Enable it to use its features": "La extensión {0} está deshabilitada en la configuración. Habilítala para usar sus funciones",
  "Welcome to {0} version {1}! The extension is now active": "¡Bienvenida a {0} versión {1}! La extensión ya está activa",
  "The {0} extension has been updated. Check out what's new in version {1}": "La extensión {0} se ha actualizado. Consulta las novedades de la versión {1}",
  "Release Notes": "Notas de la versión",
  "Dismiss": "Descartar",
  "A new version of {0} is available. Update to version {1} now": "¡Hay una nueva versión de {0} disponible! Actualiza a la versión {1} ahora",
  "Update Now": "Actualizar ahora",
  "No text editor is active!": "¡No hay editor de texto activo!",
  "The file has not been created!": "¡El archivo no se ha creado!",
  "Successfully created the file!": "¡Archivo creado con éxito!",
  "Successfully created {0}!": "¡{0} creado con éxito!",
  "Creating file: {0}": "Creando archivo: {0}",
  "Error creating file: {0}": "Error al crear archivo: {0}",
  "Error deleting file: {0}": "Error al eliminar archivo: {0}",
  "Name already exist!": "¡El nombre ya existe!",
  "No text is selected!": "¡No hay texto seleccionado!",
  "Invalid JSON Schema!": "¡Esquema JSON inválido!",
  "About Us": "Acerca de Nosotros",
  "Report Issues": "Reportar Problemas",
  "Rate Us": "Califícanos",
  "Support Us": "Apóyanos",
  "Become a Sponsor": "Conviértete en Patrocinador",
  "Donate via PayPal": "Donar a través de PayPal",
  "Executing: {0}": "Ejecutando: {0}",
  "Although {0} is offered at no cost, your support is deeply appreciated if you find it beneficial. Thank you for considering!": "Aunque {0} se ofrece de forma gratuita, tu apoyo es muy apreciado si lo encuentras útil. ¡Gracias por considerarlo!",
  "Enter the folder name": "Introduce el nombre de la carpeta",
  "The folder name must be a valid name": "El nombre de la carpeta debe ser un nombre válido",
  "Enter the class name": "Introduce el nombre de la clase",
  "Invalid format! Class names MUST be declared in PascalCase and have at least 3 characters (e.g. User, AuthService).": "Formato inválido! Los nombres de clase DEBEN declararse en PascalCase y tener al menos 3 caracteres (ej. User, AuthService).",
  "Enter the type name": "Introduce el nombre del tipo",
  "Invalid format! Entity names MUST be declared in camelCase (e.g. user, authService, userRole).": "Formato inválido! Los nombres de entidad DEBEN declararse en camelCase (ej. user, authService, userRole).",
  "Invalid format! Entity names MUST be declared in camelCase.": "¡Formato inválido! Los nombres de entidad DEBEN declararse en camelCase.",
  "Invalid format!": "¡Formato inválido!",
  "Operation cancelled by user": "Operación cancelada por el usuario",
  "Enter the component class name": "Introduce el nombre de la clase del componente",
  "Enter the directive class name": "Introduce el nombre de la clase de la directiva",
  "Enter the enum class name": "Introduce el nombre de la clase de la enumeración",
  "Enter the guard name": "Introduce el nombre del guardia",
  "Enter the interceptor class name": "Introduce el nombre de la clase del interceptor",
  "Enter the interface class name": "Introduce el nombre de la clase de la interfaz",
  "Enter the interface type name": "Introduce el nombre del tipo de interfaz",
  "Enter the module class name": "Introduce el nombre de la clase del módulo",
  "Enter the pipe class name": "Introduce el nombre de la clase de la tubería",
  "Enter the resolver class name": "Introduce el nombre de la clase del resolutor",
  "Enter the service class name": "Introduce el nombre de la clase del servicio",
  "Enter the test class name": "Introduce el nombre de la clase de la prueba",
  "Enter the test type name": "Introduce el nombre del tipo de prueba",
  "Enter the entity name": "Introduce el nombre de la entidad",
  "Select the test type": "Seleccione el tipo de prueba",
  "Enter the component name": "Introduce el nombre del componente",
  "Enter the pipe name": "Introduce el nombre de la tubería",
  "Enter the service name": "Introduce el nombre del servicio",
  "Enter the element name": "Introduce el nombre del elemento",
  "Enter the library name": "Introduce el nombre de la biblioteca",
  "Which type of guard would you like to create?": "¿Qué tipo de guardia te gustaría crear?",
  "Select the options for the component generation (optional)": "Selecciona las opciones para la generación del componente (opcional)",
  "The change detection strategy to use in the new component": "La estrategia de detección de cambios a utilizar en el nuevo componente",
  "The prefix to apply to the generated component selector": "El prefijo a aplicar al selector del componente generado",
  "The view encapsulation strategy to use in the new component": "La estrategia de encapsulación de vista a utilizar en el nuevo componente",
  "Select the options for the guard generation (optional)": "Selecciona las opciones para la generación del guardia (opcional)",
  "Select the options for the library generation (optional)": "Selecciona las opciones para la generación de la biblioteca (opcional)",
  "Select the options for the pipe generation (optional)": "Selecciona las opciones para la generación de la tubería (opcional)",
  "Select the options for the service generation (optional)": "Selecciona las opciones para la generación del servicio (opcional)",
  "The custom commands list is empty. Please add custom commands to the configuration": "La lista de comandos personalizados está vacía. Agrega comandos personalizados a la configuración",
  "The custom components list is empty. Please add custom components to the configuration": "La lista de componentes personalizados está vacía. Agrega componentes personalizados a la configuración",
  "Select the template for the custom element generation": "Selecciona la plantilla para la generación del elemento personalizado",
  "The template for the custom component does not exist. Please try again": "La plantilla para el componente personalizado no existe. Por favor, inténtalo de nuevo",
  "The type to append to the component filename": "El tipo a añadir al nombre del archivo del componente",
  "The type to append to the service filename": "El tipo a añadir al nombre del archivo del servicio",
  "The type separator to use before the type within the generated file's name": "El separador de tipo a utilizar antes del tipo en el nombre del archivo generado",
  "Folder name. E.g. src, app...": "Nombre de carpeta. Ej. src, app...",
  "E.g. User, Role, Auth...": "Ej. User, Role, Auth...",
  "E.g. class, dto, entity, model...": "Ej. class, dto, entity, model...",
  "E.g. interface, dto, entity, model...": "Ej. interface, dto, entity, model...",
  "E.g. user, role, auth...": "Ej. user, role, auth...",
  "File already exists: {0}. Please choose a different name.": "El archivo ya existe: {0}. Por favor, elija un nombre diferente.",
  "File created successfully: {0}": "Archivo creado correctamente: {0}",
  "Error creating file: {0}. Please check the path and try again.": "Error al crear el archivo: {0}. Por favor, revise la ruta e intente de nuevo.",
  "route, state": "ruta, estado",
  "childRoute, state": "rutaHija, estado",
  "component, currentRoute, currentState, nextState": "componente, rutaActual, estadoActual, estadoSiguiente",
  "route, segments": "ruta, segmentos"
}
