{
  "Welcome to {0}!": "¡Bienvenido a {0}!",
  "Looks like {0} has been updated to version {1}!": "¡Parece que {0} se ha actualizado a la versión {1}!",
  "No text editor is active!": "¡No hay editor de texto activo!",
  "The file has not been created!": "¡El archivo no ha sido creado!",
  "Successfully created the file!": "¡Archivo creado con éxito!",
  "Name already exist!": "¡El nombre ya existe!",
  "No text is selected!": "¡No hay texto seleccionado!",
  "Invalid JSON Schema!": "¡Esquema JSON inválido!",
  "About Us": "Acerca de Nosotros",
  "Report Issues": "Reportar Problemas",
  "Rate Us": "Calificanos",
  "Support Us": "Apóyanos",
  "Become a Sponsor": "Conviértete en Patrocinador",
  "Donate via PayPal": "Donar a través de PayPal",
  "Although {0} is offered at no cost, your support is deeply appreciated if you find it beneficial. Thank you for considering!": "Aunque {0} se ofrece sin costo, su apoyo es muy apreciado si lo encuentra beneficioso. ¡Gracias por considerarlo!",
  "Enter the folder name": "Ingrese el nombre de la carpeta",
  "Enter the class name": "Ingrese el nombre de la clase",
  "Enter the type name": "Ingrese el nombre del tipo",
  "Enter the component class name": "Ingrese el nombre de la clase del componente",
  "Enter the directive class name": "Ingrese el nombre de la clase de la directiva",
  "Enter the enum class name": "Ingrese el nombre de la clase de la enumeración",
  "Enter the guard name": "Ingrese el nombre del guardia",
  "Enter the interceptor class name": "Ingrese el nombre de la clase del interceptor",
  "Enter the interface class name": "Ingrese el nombre de la clase de la interfaz",
  "Enter the interface type name": "Ingrese el nombre del tipo de interfaz",
  "Enter the module class name": "Ingrese el nombre de la clase del módulo",
  "Enter the pipe class name": "Ingrese el nombre de la clase de la tubería",
  "Enter the resolver class name": "Ingrese el nombre de la clase del resolutor",
  "Enter the service class name": "Ingrese el nombre de la clase del servicio",
  "Enter the test class name": "Ingrese el nombre de la clase de la prueba",
  "Enter the test type name": "Ingrese el nombre del tipo de prueba",
  "Enter the component name": "Ingrese el nombre del componente",
  "Enter the pipe name": "Ingrese el nombre de la tubería",
  "Enter the service name": "Ingrese el nombre del servicio",
  "Enter the element name": "Ingrese el nombre del elemento",
  "Enter the library name": "Ingrese el nombre de la biblioteca",
  "Which type of guard would you like to create?": "¿Qué tipo de guardia le gustaría crear?",
  "Select the options for the component generation (optional)": "Seleccione las opciones para la generación del componente (opcional)",
  "The change detection strategy to use in the new component": "La estrategia de detección de cambios a utilizar en el nuevo componente",
  "The prefix to apply to the generated component selector": "El prefijo a aplicar al selector del componente generado",
  "The view encapsulation strategy to use in the new component": "La estrategia de encapsulación de vista a utilizar en el nuevo componente",
  "Select the options for the guard generation (optional)": "Seleccione las opciones para la generación del guardia (opcional)",
  "Select the options for the library generation (optional)": "Seleccione las opciones para la generación de la biblioteca (opcional)",
  "Select the options for the pipe generation (optional)": "Seleccione las opciones para la generación de la tubería (opcional)",
  "Select the options for the service generation (optional)": "Seleccione las opciones para la generación del servicio (opcional)",
  "Select the template for the custom element generation": "Seleccione la plantilla para la generación del elemento personalizado"
}
